In [2]:
import pandas as pd
import numpy as np

In [3]:
 df = pd.DataFrame({'name': ['Raphael', 'Donatello'],
...                    'mask': ['red', 'purple'],
...                    'weapon': ['sai', 'bo staff']})

In [5]:
df

        name    mask    weapon
0    Raphael     red       sai
1  Donatello  purple  bo staff

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
display(df)

        name    mask    weapon
0    Raphael     red       sai
1  Donatello  purple  bo staff

In [12]:
df1_flip = df.T

In [13]:
df1_flip

              0          1
name    Raphael  Donatello
mask        red     purple
weapon      sai   bo staff

In [24]:
df1_flip = df1_flip.rename(columns = {df1_flip.columns[0]: "00",df1_flip.columns[1]: "01"})

In [25]:
df1_flip

             00         01
name    Raphael  Donatello
mask        red     purple
weapon      sai   bo staff

df2 = df1_flip.T

In [26]:
df2 = df1_flip.T

In [27]:
df2

         name    mask    weapon
00    Raphael     red       sai
01  Donatello  purple  bo staff

In [30]:
df2 = df2.reset_index(0)

In [31]:
df2

  index       name    mask    weapon
0    00    Raphael     red       sai
1    01  Donatello  purple  bo staff

In [34]:
df3 = df2.rename (columns = {df2.columns[0]:"number"})

In [35]:
df3

  number       name    mask    weapon
0     00    Raphael     red       sai
1     01  Donatello  purple  bo staff

In [41]:
df3.dtypes

number    object
name      object
mask      object
weapon    object
dtype: object

In [42]:
df3["number"] = df3["number"].astype (float)

In [43]:
df3["id"] = df3["number"]+ 2

In [44]:
df

        name    mask    weapon
0    Raphael     red       sai
1  Donatello  purple  bo staff

In [45]:
df3

   number       name    mask    weapon   id
0     0.0    Raphael     red       sai  2.0
1     1.0  Donatello  purple  bo staff  3.0

In [46]:
df3["sum"] = df3["number"] + df3["id"]

In [47]:
df3

   number       name    mask    weapon   id  sum
0     0.0    Raphael     red       sai  2.0  2.0
1     1.0  Donatello  purple  bo staff  3.0  4.0